; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph0 - mode
	image2 - mode
	image3 - mode
	infrared1 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Star8 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star14 - direction
	GroundStation6 - direction
	Star13 - direction
	GroundStation7 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation2 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument2 infrared1)
	(supports instrument2 image3)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation10)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite1 Star14)
	(have_image Star15 thermograph0)
	(have_image Star16 image2)
	(have_image Phenomenon17 image2)
	(have_image Phenomenon18 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation10 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation10)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite1 instrument2 groundstation10)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite1 phenomenon17 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 5
5. (turn_to satellite0 groundstation7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 5
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
7. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 5
8. (take_image satellite1 phenomenon17 instrument2 image2)
   added: (have_image phenomenon17 image2)
   goals met: 1 of 5
9. (turn_to satellite0 star15 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star15)
   goals met: 1 of 5
10. (take_image satellite0 star15 instrument0 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 2 of 5
11. (turn_to satellite1 phenomenon18 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon18)
   goals met: 2 of 5
12. (take_image satellite1 phenomenon18 instrument2 infrared1)
   added: (have_image phenomenon18 infrared1)
   goals met: 3 of 5
13. (turn_to satellite1 star16 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 star16)
   goals met: 3 of 5
14. (take_image satellite1 star16 instrument2 image2)
   added: (have_image star16 image2)
   goals met: 4 of 5
15. (turn_to satellite1 star14 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star14)
   goals met: 5 of 5
